class Basket {
    constructor() {
        /*здесь будут объявляться основные переменные*/
    }
    addToCart() {
        /*здесь будет происходить добавление товара в корзину*/
    }
    removeFromCart() {
        /*здесь будет происходить удаление товара из корзины*/
    }
    getSum() {
        /*здесь будет суммироваться стоимость всех товаров в корзине*/
    }
    render() {
        /*здесь будет создаваться вид корзины*/
    }
}
class ProductInBasket {
    /*Здесь будет создаваться вид товара, добавленный в корзину*/
}